var MongoClient = require('mongodb').MongoClient;
var url = "mongodb://localhost:27017/";

MongoClient.connect(url, function(err, db) {
    if (err) throw err;
    var dbo = db.db("studentsdb");
    var students = [{
            fullName: 'Кадушина Виктория Александровна',
            marks: {
                'Информатика': [3, 4, 5, 5],
                'Физика': [5, 4, 5, 5],
                'Математика': [5, 4, 5, 5]
            },
        }, {
            fullName: 'Кадыкова Юлия Александровна',
            marks: {
                'Информатика': [5, 4, 5],
                'Физика': [5, 4, 5, 5],
                'Математика': [5, 4, 5, 5]
            },
        }, {
            fullName: 'Раткин Василий Викторович',
            marks: {
                'Информатика': [5, 4, 5, 5],
                'Физика': [5, 4, 5, 5],
                'Математика': [5, 4, 5, 5]
            },
        }, {
            fullName: 'Родионов Игорь Владимирович',
            marks: {
                'Информатика': [2, 3, 3, 3],
                'Физика': [5, 4, 5, 5],
                'Математика': [3, 4, 5, 5]
            },
        }, {
            fullName: 'Табоякова Юлия Викторовна',
            marks: {
                'Информатика': [5, 4, 5, 5],
                'Физика': [5, 4, 5, 5],
                'Математика': [5, 4, 5, 5]
            },
        }, {
            fullName: 'Жданов Сергей Александрович',
            marks: {
                'Русский язык': [2, 2, 3, 3],
                'Физика': [5, 4, 5, 5],
                'Математика': [5, 4, 5, 5]
            },
        }, {
            fullName: 'Глазков Виктор Петрович',
            marks: {
                'Информатика': [2, 3, 3, 3],
                'Физика': [5, 4, 5, 5],
                'Математика': [5, 4, 3, 5]
            },
        }, {
            fullName: 'Головенкова Екатерина Викторовна',
            marks: {
                'Информатика': [2, 2, 3, 3],
                'Физика': [5, 3, 5, 5],
                'Математика': [5, 4, 5, 5]
            },
        }, {
            fullName: 'Овчинников Игорь Георгиевич',
            marks: {
                'Информатика': [3, 2, 3, 3],
                'Физика': [5, 4, 5, 5],
                'Математика': [5, 4, 5, 5]
            },
        }, {
            fullName: 'Осипов Олег Владимирович',
            marks: {
                'Информатика': [2, 3, 3, 3],
                'Физика': [5, 4, 5, 5],
                'Математика': [5, 4, 5, 5]
            },
        }

    ];
    dbo.collection("customers").insertMany(students, function(err, res) {
        if (err) throw err;
        console.log("Number of documents inserted: " + res.insertedCount);
        db.close();
    });
});